ASC_CalculationAlgorithms/Documents/АСЦ_Платеж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>АСЦ_Платеж</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПлатежногоДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВалюты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтатьиДДС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЦФО</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентГУИД</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияСсылка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаСч</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННОрганизации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППОрганизации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВЦентральнойБазе</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданныйДокументВБазе</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежаЭквайринга</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.АСЦ_ВидыПлатежаЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>pay_tool</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКассы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОплаты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаXML</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБанковскогоДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВзаиморасчетов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСсылка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаСч</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетВзаиморасчетов</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ASC_CalculationAlgorithms/Enums/ВидыДоговоровКонтрагентовУХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентовУХ</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ASC_CalculationAlgorithms/Documents/АСЦ_Платеж/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СконвертироватьДокумент() Экспорт
	//
	//Если ЗначениеЗаполнено(СозданныйДокументВБазе) Тогда
	//	// Повторно документ не конвертируем
	//	Возврат;
	//КонецЕсли;
	
	Если ВидПлатежногоДокумента = "ПКО" Тогда
		
		Если ТочкаОплаты = "Оперкасса" Тогда 
			ВызватьИсключение "Документ от оперкассы не будет сконвертирован";
		КонецЕсли;
		
		Если ПустаяСтрока(ТочкаОплаты) Тогда
			ВызватьИсключение "В документе не указан реквизит Точка оплаты, документ не будет сконвертирован";
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументРТУ = ЗаполнитьНедостающиеСсылки();
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		ВызватьИсключение "Не найден контрагент";
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		ВызватьИсключение "Не найден договор";
	КонецЕсли;	
	
	Если ВидПлатежногоДокумента = "ПКО" 
		И СпособПлатежа <> "Банковская карта" Тогда
		СоздатьПКО(ДокументРТУ);
		
	ИначеЕсли ВидПлатежногоДокумента = "ППВ" Тогда 
		СоздатьПоступлениеДС(ДокументРТУ);
		
	ИначеЕсли ВидПлатежногоДокумента = "ПКО" 
		И СпособПлатежа = "Банковская карта" Тогда
		СоздатьОплатаПлатежнойКартой(ДокументРТУ);
	КонецЕсли;
		
КонецПроцедуры	

Функция ЗаполнитьНедостающиеСсылки() Экспорт
	
	СвойствоIDСчета = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ID_Счета");
	ДокументРТУ = АСЦ_ПоискОбъектов.НайтиДокументПоСвойству(СсылкаСч, СвойствоIDСчета, "РеализацияТоваровУслуг");
	
	Если ЗначениеЗаполнено(ДокументРТУ) Тогда
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРТУ, "Контрагент, ДоговорКонтрагента");
		Контрагент = РеквизитыДокумента.Контрагент;
		Договор    = РеквизитыДокумента.ДоговорКонтрагента;
		
	Иначе	
		
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			Контрагент = АСЦ_ПоискОбъектов.НайтиКонтрагента(НаименованиеКонтрагента, ИННКонтрагента, КППКонтрагента);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контрагент)
			И ЗначениеЗаполнено(ДоговорНомер) Тогда
			
			пДоговорНомер = СтрЗаменить(ДоговорНомер, " ", "");
			Договор = АСЦ_ПоискОбъектов.НайтиДоговор(Контрагент, Организация, пДоговорНомер, Перечисления.ВидыДоговоровКонтрагентовУХ.СПокупателем);
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ДокументРТУ;
	
КонецФункции	

Функция ПолучитьВидОплаты()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОплатОрганизаций КАК Спр
	|ГДЕ
	|	НЕ Спр.ПометкаУдаления
	|	И Спр.Организация = &Организация";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0][0];
	Иначе	
		
		СпрОбъект = Справочники.ВидыОплатОрганизаций.СоздатьЭлемент();
		СпрОбъект.Наименование = "Оплата картой";
		СпрОбъект.Организация  = Организация;
		СпрОбъект.ТипОплаты    = Перечисления.ТипыОплат.ПлатежнаяКарта;
		СпрОбъект.СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;          //57.03
		СпрОбъект.Контрагент   = АСЦ_ПоискОбъектов.НайтиКонтрагента("", "7734202860", "770801001"); //МКБ
		
		ДанныеДоговора = Новый Структура;
		ДанныеДоговора.Вставить("Организация",   Организация);
		ДанныеДоговора.Вставить("Контрагент",    СпрОбъект.Контрагент);
		ДанныеДоговора.Вставить("Наименование",  "Договор эквайринга");
		ДанныеДоговора.Вставить("ВидДоговораУХ", Перечисления.ВидыДоговоровКонтрагентовУХ.Прочее);
		
		СпрОбъект.ДоговорКонтрагента = АСЦ_ПоискОбъектов.ПолучитьДоговор(ДанныеДоговора, Ложь, Ложь, Ложь);
		СпрОбъект.Записать();
		
		Возврат СпрОбъект.Ссылка;
		
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьДоговорЭквайринга(БанкКонтрагент)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОплатОрганизаций КАК Спр
	|ГДЕ
	|	НЕ Спр.ПометкаУдаления
	|	И Спр.Организация = &Организация";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0][0];
	Иначе	
		
		СпрОбъект = Справочники.ВидыОплатОрганизаций.СоздатьЭлемент();
		СпрОбъект.Наименование = "Оплата картой";
		СпрОбъект.Организация  = Организация;
		СпрОбъект.ТипОплаты    = Перечисления.ТипыОплат.ПлатежнаяКарта;
		СпрОбъект.СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;          //57.03
		СпрОбъект.Контрагент   = АСЦ_ПоискОбъектов.НайтиКонтрагента("", "7734202860", "770801001"); //МКБ
		СпрОбъект.Записать();
		
		Возврат СпрОбъект.Ссылка;
		
	КонецЕсли;
	
КонецФункции	

Процедура СоздатьПКО(ДокументРТУ)
	
	Если ЗначениеЗаполнено(СозданныйДокументВБазе) Тогда
		ДокументОбъект = СозданныйДокументВБазе.ПолучитьОбъект();
		ДокументОбъект.РасшифровкаПлатежа.Очистить();
	Иначе	
		ДокументОбъект = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	КонецЕсли;	
	
	ВремяДокумента = Документы.ПриходныйКассовыйОрдер.ВремяДокументаПоУмолчанию();
	ДокументОбъект.Дата        = НачалоДня(Дата) + 3600 * ВремяДокумента.Часы + 60 * ВремяДокумента.Минуты;
	
	Если ЗначениеЗаполнено(ДокументРТУ) Тогда
		ДокументОбъект.Заполнить(ДокументРТУ);
	Иначе	
		
		ДокументОбъект.Организация = Организация;
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
		ДокументОбъект.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(КодВалюты);
		ДокументОбъект.СуммаДокумента = СуммаДокумента;
		ДокументОбъект.Контрагент     = Контрагент;
		
		ЗаполнитьРасшифровкуПлатежа(ДокументОбъект.РасшифровкаПлатежа);
		
	КонецЕсли;	

	ДокументОбъект.СчетКасса   = ПланыСчетов.Хозрасчетный.КассаОрганизации; //50.01
	ЗаписатьСозданныйДокумент(ДокументОбъект);
	
КонецПроцедуры	

Процедура СоздатьПоступлениеДС(ДокументРТУ)
	
	Если ЗначениеЗаполнено(СозданныйДокументВБазе) Тогда
		ДокументОбъект = СозданныйДокументВБазе.ПолучитьОбъект();
		ДокументОбъект.РасшифровкаПлатежа.Очистить();
	Иначе	
		ДокументОбъект = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
	КонецЕсли;	
	
	ВремяДокумента = Документы.ПоступлениеНаРасчетныйСчет.ВремяДокументаПоУмолчанию();
	ДокументОбъект.Дата        = НачалоДня(Дата) + 3600 * ВремяДокумента.Часы + 60 * ВремяДокумента.Минуты;
	
	Если ЗначениеЗаполнено(ДокументРТУ) Тогда
		ДокументОбъект.Заполнить(ДокументРТУ);
	Иначе	
		
		ДокументОбъект.Организация = Организация;
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя;
		ДокументОбъект.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(КодВалюты);
		ДокументОбъект.НомерВходящегоДокумента = НомерВходящегоДокумента;
		ДокументОбъект.ДатаВходящегоДокумента  = ДатаВходящегоДокумента;
		ДокументОбъект.СчетОрганизации = БанковскийСчет;
		ДокументОбъект.Контрагент  = Контрагент;
		ДокументОбъект.СуммаДокумента = СуммаДокумента;
		
		ЗаполнитьРасшифровкуПлатежа(ДокументОбъект.РасшифровкаПлатежа);
		
	КонецЕсли;	
	
	ДокументОбъект.СчетБанк    = ПланыСчетов.Хозрасчетный.РасчетныеСчета; //51
	ЗаписатьСозданныйДокумент(ДокументОбъект);
	
КонецПроцедуры	

Процедура СоздатьОплатаПлатежнойКартой(ДокументРТУ)
	
	Если ЗначениеЗаполнено(СозданныйДокументВБазе) Тогда
		ДокументОбъект = СозданныйДокументВБазе.ПолучитьОбъект();
		ДокументОбъект.РасшифровкаПлатежа.Очистить();
	Иначе	
		ДокументОбъект = Документы.ОплатаПлатежнойКартой.СоздатьДокумент();
	КонецЕсли;	
	
	ВремяДокумента = Документы.ОплатаПлатежнойКартой.ВремяДокументаПоУмолчанию();
	ДокументОбъект.Дата        = НачалоДня(Дата) + 3600 * ВремяДокумента.Часы + 60 * ВремяДокумента.Минуты;
	
	Если ЗначениеЗаполнено(ДокументРТУ) Тогда
		ДокументОбъект.Заполнить(ДокументРТУ);
	Иначе	
		
		ДокументОбъект.Организация = Организация;
		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя;
		ДокументОбъект.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(КодВалюты);
		ДокументОбъект.СуммаДокумента = СуммаДокумента;
		ДокументОбъект.Контрагент  = Контрагент;
		
		ЗаполнитьРасшифровкуПлатежа(ДокументОбъект.РасшифровкаПлатежа);
	
	КонецЕсли;	
	
	ДокументОбъект.СчетКасса   = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам; //57.03
	ДокументОбъект.ВидОплаты   = ПолучитьВидОплаты();
	ДокументОбъект.Эквайер     = ДокументОбъект.ВидОплаты.Контрагент;
	ДокументОбъект.ДоговорЭквайринга = ДокументОбъект.ВидОплаты.ДоговорКонтрагента;
	
	ЗаписатьСозданныйДокумент(ДокументОбъект);
	
КонецПроцедуры	

Процедура ЗаполнитьРасшифровкуПлатежа(ДокументРасшифровкаПлатежа)
	
	Если Ложь Тогда
		ДокументРасшифровкаПлатежа = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент().РасшифровкаПлатежа;
	КонецЕсли; 
	
	// Нет соответствия статей УПП и АСТРА, 
	// но у нас всегда 1 статья и она уже проставлена в договоре
	СтатьяДДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ОсновнаяСтатьяДвиженияДенежныхСредств");
	
	Для каждого СтрокаТЧ из РасшифровкаПлатежа Цикл
		
		НоваяСтрока = ДокументРасшифровкаПлатежа.Добавить();
		НоваяСтрока.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
		НоваяСтрока.СуммаПлатежа = СтрокаТЧ.Сумма;
		НоваяСтрока.СуммаВзаиморасчетов = СтрокаТЧ.Сумма;
		НоваяСтрока.КурсВзаиморасчетов  = 1;
		НоваяСтрока.КратностьВзаиморасчетов = 1;
		НоваяСтрока.ДоговорКонтрагента  = Договор;
		НоваяСтрока.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками; // 76.05
		НоваяСтрока.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками; // 76.05
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС)
			ИЛИ СтрокаТЧ.СтавкаНДС = 0 Тогда // Ставка 0 у нас не используется
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		Иначе	
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС["НДС" + СтрокаТЧ.СтавкаНДС];
		КонецЕсли;	
		
		Попытка
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
		Исключение
		КонецПопытки;	
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаписатьСозданныйДокумент(ДокументОбъект)
	
	НачатьТранзакцию();
	
	ДокументОбъект.Записать();
	
	Запись = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьМенеджерЗаписи();
	Запись.УзелОбмена = ПланыОбмена.Полный.ЭтотУзел();
	Запись.Документ   = ДокументОбъект.Ссылка;
	Запись.ДатаДокумента = ДокументОбъект.Дата;
	Запись.Записать();
	
	СозданныйДокументВБазе = ДокументОбъект.Ссылка;
	
	Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецЕсли
